import { useNavigate } from 'react-router-dom';
import styles from './CampsPage.module.css'

export default function CampsPage() {
  const navigate = useNavigate()

  return (
    <section className={styles.wrapper}>
      <div className={styles.overlay} />
      <div className={styles.card}>
        <h1 className={styles.heading}>Летен детски лагер в „Див чифлик“</h1>
        <h2 className={styles.heading2}>За деца над 5-годишна възраст</h2>

        <p className={styles.paragraph}>
          Запишете детето си за нашия летен детски лагер, където приключенията,
          забавлението и ученето вървят ръка за ръка! Това е идеалното място за
          вашето дете да се запознае с природата, животните и спорта, да развие нови
          умения и да създаде незабравими спомени.
        </p>

        <p style={{ fontWeight: '800', fontSize: '1.1em' }}>Програма на лагера:</p>
        <ul>
          <li style={{ fontWeight: '800' }}>5-дневен лагер (понеделник – петък)</li>
          <li style={{ fontWeight: '800' }}>Цена: 350 лева/5 дни (с включена храна)</li>
          <li><strong>Ежедневна тренировка по езда</strong> – Всеки ден децата ще се учат как да яздят, да
            се грижат за конете и да развиват умения за баланс и контрол. Независимо
            дали са начинаещи или имат предишен опит, всеки ще получи индивидуално
            внимание и подкрепа от нашите инструктори.
          </li>
          <li>
            <strong>Два пъти седмично стрелба с лък</strong> – Това е отлична възможност за децата да
            развият концентрацията, точността и координацията си, докато се забавляват.
          </li>
          <li>
            <strong>Образователни беседи</strong> – Ще имат възможност да научат интересни факти за
            природата, животните и екологията. Чрез активни беседи децата ще разширят
            знанията си за света около тях.
          </li>
          <li>
            <strong>Участие в грижи за животните</strong> – Децата ще научат как да се грижат за конете,
            както и за други животни на базата, като по този начин развиват отговорност и
            любов към животните.
          </li>
          <li>
            <strong>Спортни игри и занимания на открито</strong> – Ще организираме различни забавни
            игри, които ще стимулират физическата активност, екипната работа и
            социализацията на децата.
          </li>
          <li>
            <strong>Работилнички</strong> – всяка седмица в един от дните ще бъде организирана
            работилничка, в която ще бъдат изработвани различни неща от картички ,
            паячета от конци, различни тематични рисунки до дървени въдички. Стремим
            се да разгърнем индивидуалността и креативността на всяко дете, чрез допир
            на различни материали и тяхното приложение.
          </li>
          <li>
            <strong>Допълнителни възможности</strong>:
            С предварително записване е възможно записване за отделни дни – 70
            лева/ден. Това дава гъвкавост на родителите, които искат децата им да се
            включат в лагера само за определени дни.
          </li>
        </ul>

        <p style={{ fontWeight: '800', fontSize: '1.1em' }}>Какво да носите:</p>
        <p>Нека децата се подготвят за приключение – носете си удобни дрехи за игра и
          спорт, шише за многократна употреба, както и хубави обувки за езда. Не
          забравяйте да донесете и добро настроение, защото в нашия лагер ще се
          случат много забавни и вълнуващи моменти!
        </p>
        <p>Очакваме ви с нетърпение за едно незабравимо лято в „Див чифлик”!</p>

        <div className={styles.buttons}>
          <button onClick={() => navigate('/reservation')} className={styles.button}>
            Резервирай езда
          </button>
          <button onClick={() => navigate('/campform')} className={styles.button}>
            Запиши за лагер
          </button>
          <button onClick={() => navigate('/prices')} className={styles.button}>
            Цени
          </button>
        </div>
      </div>
    </section>
  )
}
