export type Horse = {
  name: string
  description: string
  imagePaths: string[]
  id: string
  age: number
}

export const HORSES: Horse[] = [
  {
    id: '1',
    name: 'Блу',
    description: 'Блу е благороден и спокоен кон, идеален за начинаещи ездачи. Той обожава да прекарва време в манежа и е изключително лесен за управление. Отличава се със едното си наполовина синьо око, както и със интересните разцветки на тялото си. Много лесно създава връзка с ездачите си и бързо печели доверието им.',
    age: 8,
    imagePaths: ['/images/horses/blu/b1.jpg', '/images/horses/blu/b2.jpg', '/images/horses/blu/b3.jpg', '/images/horses/blu/b4.jpg', '/images/horses/blu/b5.jpg', '/images/horses/blu/b6.jpg', '/images/horses/blu/b7.jpg'],
  },
  {
    id: '2',
    name: 'Джо Прешес',
    description: 'Прешес е стар приятел на базата – с големи и меки очи, той има спокоен характер, който го прави перфектен за спокойни разходки в природата. Въпреки възрастта си, Джо е изключително активен и не пропуска да участва във всяко приключение. Харесва да бъде в компания и е много социален.',
    age: 12,
    imagePaths: ['/images/horses/jp/jp1.jpg'],
  },
  {
    id: '3',
    name: 'Джухара',
    description: 'Джухара е грациозна и нежна кобила, която обича да се грижи за малките и нови ездачи. Тя е известна със своето спокойствие и интелигентност, лесно се адаптира към всяка ситуация. Отличава се с дълга черна грива, която често привлича погледите на всички посетители.',
    age: 6,
    imagePaths: ['/images/horses/juhara/j1.jpg', '/images/horses/juhara/j2.jpg', '/images/horses/juhara/j3.jpg'],
  },
  {
    id: '4',
    name: 'Зехир',
    description: 'Силен и величествен, Зехир е лидер сред конете на базата. Той има невероятно уважение към ездачите и е идеален за по-напреднали ездачи,които търсят вълнуващи преходи. Отличава се със своята голяма и мускулеста фигура, а също така е много лоялен към хората си.',
    age: 10,
    imagePaths: ['/images/horses/zehir/z1.jpg', '/images/horses/zehir/z2.jpg', '/images/horses/zehir/z3.jpg', '/images/horses/zehir/z4.jpg'],
  },
  {
    id: '5',
    name: 'Ласка',
    description: "Млад и енергичен, Ласка е кон с изключителен инстинкт за бързина и приключения. Силна и стегната, тя обича да препуска по откритит полета, но е и много внимателен към начинаещите ездачи. Една от любимците на посетителите, заради своята невероятна енергия и радост, която излъчва.",
    age: 5,
    imagePaths: ['/images/horses/laska/l1.jpg', '/images/horses/laska/l2.jpg', '/images/horses/laska/l3.jpg', '/images/horses/laska/l4.jpg'],
  },
  {
    id: '6',
    name: 'Пепина',
    description: 'Пепина е кобила с тъмно-кафява козина и искрящо черни очи. Изключително бърза и смела, тя е идеална за по-дълги преходи и галопи през горите. Пепина обича да бъде водеща и често води групи през трудни маршрути, като винаги е на стража за безопасността на останалите коне и ездачи.',
    age: 7,
    imagePaths: ['/images/horses/pepina/p1.jpg', '/images/horses/pepina/p2.jpg', '/images/horses/pepina/p3.jpg', '/images/horses/pepina/p4.jpg'],
  },
]
