type Instructor = {
  name: string
  url: string
  description: string
}

export const INSTRUCTORS: Instructor[] = [
  {
    name: 'Виктория',
    url: '/public/images/instructors-avatars/vicky.png',
    description: 'Вики е част от екипа на базата от 8 години и се отличава със своето позитивно отношение и любов към децата. Тя има специално обучение по детска психология и езда и обича да запалва младите сърца за този спорт. Тя може да създаде приятна и спокойна атмосфера за всяко дете, което се запознава с ездата. Интересен факт: Вики е била доброволец в младежки програми, свързани с животни, и е обучавала деца с емоционални проблеми чрез езда.',
  },
  {
    name: 'Борис',
    url: '/public/images/instructors-avatars/boris.jpg',
    description: 'Силата на Борис е в обучението на начинаещи, като със своята търпеливост и внимание към детайла, създава перфектна основа за всеки ездач. Интересен факт: Борис има страст към кросовите мотори плюс, че обича да заснема красивите пейзажи по време на преходите които си организира.',
  },
  {
    name: 'Ева',
    url: '/public/images/instructors-avatars/eva.jpg',
    description: 'Ева е инструктор в базата от 4 години и е известна със своето спокойствие и дълбоката връзка с конете. Тя обучава ездачи да работят с конете без седло, както и да развиват интуицията си по време на езда. Ева е изключително талантлива в разпознаването на нуждите на конете и обича да работи с животни, които имат трудности с адаптацията. Интересен факт: Ева е сертифициран инструктор за всички видове езда, занимава се с езда от 5 годишна.'
  },
  {
    name: 'Ивайло',
    url: '/public/images/instructors-avatars/ivaylo.jpg',
    description: 'Ивайло е инструктор в „Див чифлик“ от 10 години и е известен със своята сила и енергия. Той е истински ентусиаст на галопа и природните преходи и е специализиран в подготовката на по-напреднали ездачи за по-сложни маршрути. Обича да води групи по трудни и предизвикателни пътеки в Балкана. Интересен факт: Ивайло е участвал в състезания по конен туризъм и е спечелил награди за най-добро водене на преходи.',
  },
  {
    name: 'Павлета',
    url: '/public/images/instructors-avatars/pavleta.jpg',
    description: 'Павлета е в базата от 2 години, но за сметка на това има дългогодишен опит в конната езда и в работата с деца, по професия е детска учителка, но открива страстта към конете и работата с деца сред природата . Тя обучава ездачи, които искат да развият своите умения в манежа и да се подготвят за следващите етапи от ездата. Интересен факт: Павлета е била национален шампион по стрелба с лък и практикува и до днес, ако напреднете достатъчно тя може да ви научи да стреляте с лък и от кон.',
  },
]
